
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details>
<summary>Show Plan</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["app-android-anki-chinese-flashcards-enricher"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"bb11cb5f5d600776077c7bfc9201cad296ffbf4e9cf05cec3fa63df72d177692\"" -> "W/\"4ff136ae51606baad7aa34825391e78594d83d4cc162758dae9adc16ad93162d\""
        id                                      = "app-android-anki-chinese-flashcards-enricher"
        name                                    = "app-android-anki-chinese-flashcards-enricher"
      ~ topics                                  = [
          - "android",
          - "app",
          - "kotlin",
            # (1 unchanged element hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_organization_settings.organization will be updated in-place
  ~ resource "github_organization_settings" "organization" {
      ~ advanced_security_enabled_for_new_repositories               = false -> true
        id                                                           = "122202585"
      ~ secret_scanning_push_protection_enabled_for_new_repositories = false -> true
        # (21 unchanged attributes hidden)
    }

  # github_team.admins will be created
  + resource "github_team" "admins" {
      + create_default_maintainer = true
      + description               = "Grants admin rights to all shishifubing repositories"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "admins"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.bot will be created
  + resource "github_team_membership" "bot" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "shishifubing-bot"
    }

  # github_team_repository.admins[".github"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = ".github"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["app-android-anki-chinese-flashcards-enricher"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-android-anki-chinese-flashcards-enricher"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["app-cli-autoscroll"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-cli-autoscroll"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["app-desktop-useless-cpp-gui"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-desktop-useless-cpp-gui"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["app-web-crawler-book-creator"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-web-crawler-book-creator"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["app-web-django-assignment"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-web-django-assignment"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["app-web-tianyi"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-web-tianyi"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["ci-actions-common"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "ci-actions-common"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["infra-cloud-shishifubing.com"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "infra-cloud-shishifubing.com"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["infra-repos-shishifubing"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "infra-repos-shishifubing"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["misc-personal-dotfiles"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "misc-personal-dotfiles"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["plugin-firefox-new-tab-bookmarks"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "plugin-firefox-new-tab-bookmarks"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["plugin-sonatype-nexus-security-check"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "plugin-sonatype-nexus-security-check"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["shishifubing.github.io"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "shishifubing.github.io"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["snippets-golang-leetcode"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "snippets-golang-leetcode"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["snippets-javascript-assignments"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "snippets-javascript-assignments"
      + team_id    = (known after apply)
    }

  # github_team_repository.admins["template-repository-default"] will be created
  + resource "github_team_repository" "admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "template-repository-default"
      + team_id    = (known after apply)
    }

  # module.repositories[".github"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = ".github"
        name                                    = ".github"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (3 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["app-android-anki-chinese-flashcards-enricher"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "app-android-anki-chinese-flashcards-enricher"
        name                                    = "app-android-anki-chinese-flashcards-enricher"
      ~ topics                                  = [
          + "android",
          + "app",
          + "conventional-commits",
          + "kotlin",
          + "semver",
            # (1 unchanged element hidden)
        ]
        # (37 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-cli-autoscroll"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "app-cli-autoscroll"
        name                                    = "app-cli-autoscroll"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (7 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["app-desktop-useless-cpp-gui"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "app-desktop-useless-cpp-gui"
        name                                    = "app-desktop-useless-cpp-gui"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (10 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["app-web-crawler-book-creator"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "app-web-crawler-book-creator"
        name                                    = "app-web-crawler-book-creator"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (14 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["app-web-django-assignment"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "app-web-django-assignment"
        name                                    = "app-web-django-assignment"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (15 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["app-web-tianyi"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "app-web-tianyi"
        name                                    = "app-web-tianyi"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (19 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["ci-actions-common"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "ci-actions-common"
        name                                    = "ci-actions-common"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["infra-cloud-shishifubing.com"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "infra-cloud-shishifubing.com"
        name                                    = "infra-cloud-shishifubing.com"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (9 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["infra-repos-shishifubing"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "infra-repos-shishifubing"
        name                                    = "infra-repos-shishifubing"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["misc-personal-dotfiles"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "misc-personal-dotfiles"
        name                                    = "misc-personal-dotfiles"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (8 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["plugin-firefox-new-tab-bookmarks"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "plugin-firefox-new-tab-bookmarks"
        name                                    = "plugin-firefox-new-tab-bookmarks"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (10 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["plugin-sonatype-nexus-security-check"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "plugin-sonatype-nexus-security-check"
        name                                    = "plugin-sonatype-nexus-security-check"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (12 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["shishifubing.github.io"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "shishifubing.github.io"
        name                                    = "shishifubing.github.io"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (3 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["snippets-golang-leetcode"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "snippets-golang-leetcode"
        name                                    = "snippets-golang-leetcode"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["snippets-javascript-assignments"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "snippets-javascript-assignments"
        name                                    = "snippets-javascript-assignments"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (7 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["template-repository-default"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                                      = "template-repository-default"
        name                                    = "template-repository-default"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (6 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 19 to add, 18 to change, 0 to destroy.

```

</details>


Pushed by: @tiandaoburen
Action: `pull_request`
